my_app/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "quantity", "validity", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "café de minas"], ["quantity", 8], ["validity", 12102018], ["provider", "fazenda guaxupé"], ["created_at", "2018-01-14 21:16:25.580047"], ["updated_at", "2018-01-14 21:16:25.580047"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products"
---
  def index
    # irá buscar no bd TODOS os registros contidos na tabela products
    # instanciá-los como objetos da classe Product
    # e armazená-los na variável @products
    @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]
---
  def destroy
    # irá procurar no bd um loja com o id informado nos parâmetros
    @product = Product.find(params[:id])
    # irá excluir o produto do bd
    @product.destroy